In [1]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David","Eve"],
        "Age":[25,30,35,40,45],}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [2]:
df["Age"]

0    25
1    30
2    35
3    40
4    45
Name: Age, dtype: int64

In [3]:
# データ型の変換
# 数値型→数値型
df["Age"] = df["Age"].astype(float)

In [4]:
df

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  35.0
3    David  40.0
4      Eve  45.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      float64
dtypes: float64(1), object(1)
memory usage: 212.0+ bytes